In [6]:
email_visits = 1000 # количество визитов из рассылок
context_visits = 2500 # количество визитов из контекстной рекламы
email_purchases = 50 # количество покупок из рассылок
context_purchases = 100 # количество покупок из контекстной рекламы

#### 1.Рассчитайте конверсию визитов в покупки из рассылок и контекстной рекламы, сохраните значения в переменных email_conversion и context_conversion соответственно.

In [15]:
email_conversation = email_purchases / email_visits * 100
context_conversation = context_purchases / context_visits * 100

print('Конверсия рассылок {} %'.format(email_conversation)) 
print('Конверсия контекстной рекламы {} %'.format(context_conversation))

Конверсия рассылок 5.0 %
Конверсия контекстной рекламы 4.0 %

#### 2. Продолжим автоматизировать труд маркетологов: научим Python сравнивать источники трафика и выбирать лучший. Если конверсия рассылок email_conversion больше конверсии контекстной рекламы context_conversion, выведите на экран: 'Вывод: рассылки эффективнее'. Если наоборот, то: 'Вывод: контекстная реклама эффективнее'

In [16]:
if email_conversation > context_conversation:
    print('Вывод: рассылки эффективнее')
elif email_conversation < context_conversation:
    print('Вывод: контекстная реклама эффективнее')
else:
    print('Конверсии равны, пора смотреть другие метрики')

Вывод: рассылки эффективнее

#### 3. Вы уже умеете находить конверсию. Рассчитайте другую важную для бизнеса метрику — долю повторных покупателей. В переменной total посчитайте общее количество покупателей: сложите число пользователей, совершивших одну покупку, с числом тех, кто совершил две и более.

In [17]:
first_purchase = 885 # количество пользователей, совершивших 1 покупку
repeated_purchase = 136 # количество пользователей, совершивших 2 и более покупок

In [20]:
total = first_purchase + repeated_purchase
print('Общее кол-во покупателей:', total)

Общее кол-во покупателей: 1021

#### 4. Посчитайте долю повторных покупок как отношение repeated_purchase к total. Ответ положите в переменную repeated_purchase_part.Результат выведите на экран так: 'Доля повторных покупок равна ...%'. Процент отобразите в виде целого числа — с точностью ноль знаков после запятой.

In [25]:
repeated_purchase_part = repeated_purchase / total * 100
print('Доля повторных покупок равна {:.0f} %'.format(repeated_purchase_part))

Доля повторных покупок равна 13 %

#### 5. Вам прислали таблицу со статистикой первичных и повторных покупок по источникам трафика. Прочитайте содержимое файла returned.csv и сохраните его в датафрейме purchases. Посчитайте общее число покупок для каждого источника трафика. Результат запишите в столбец 'total'. Выведите весь датафрейм на экран.

In [26]:
import pandas as pd

In [29]:
purchases = pd.read_csv('data/returned.csv')
purchases

    source  first  repeated
0  context   2933        96
1    email    885       136
2      smm   1653       139

In [30]:
purchases['total'] = purchases['first'] + purchases['repeated']
purchases

    source  first  repeated  total
0  context   2933        96   3029
1    email    885       136   1021
2      smm   1653       139   1792

#### 6. Для каждого источника трафика посчитайте долю повторных покупок — отношение количества повторных ко всем покупкам. Выведите весь датафрейм на экран.

In [32]:
purchases['repeated_share'] = purchases['repeated'] / purchases['total'] 
purchases

    source  first  repeated  total  repeated_share
0  context   2933        96   3029        0.031694
1    email    885       136   1021        0.133203
2      smm   1653       139   1792        0.077567

#### 7. Постройте рейтинг источников трафика по доле повторных покупок. Отсортируйте датафрейм purchases по убыванию значений столбца 'repeated_share'. Выражение напишите в скобках функции print(), чтобы вывести результат на экран.

In [34]:
print(purchases.sort_values('repeated_share', ascending=False))

    source  first  repeated  total  repeated_share
1    email    885       136   1021        0.133203
2      smm   1653       139   1792        0.077567
0  context   2933        96   3029        0.031694

In [37]:
logs = pd.read_csv('data/logs.csv')
logs

           user_id   source       email  purchase
0       7141786820    other         NaN         0
1       5644686960    email  c129aa540a         0
2       1914055396  context         NaN         0
3       4099355752    other         NaN         0
4       6032477554  context         NaN         1
...            ...      ...         ...       ...
199995  8714621942    other         NaN         0
199996  6064948744  context         NaN         1
199997  9210683879  context         NaN         0
199998  1629959686    other         NaN         1
199999  2089329795    other         NaN         0

[200000 rows x 4 columns]

In [38]:
logs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   200000 non-null  int64
 1   source    200000 non-null  object
 2   email     13953 non-null   object
 3   purchase  200000 non-null  int64
dtypes: int64(2), object(2)
memory usage: 6.1+ MB

#### 8. Посчитайте количество уникальных email и уникальных User ID в таблице logs.

In [58]:
print('Кол-во уникальных email',len(logs['email'].unique()) - 1)  # -1 т.к NaN тоже берется как уникальное значение
print('Кол-во уникальных user_id',len(logs['user_id'].unique()))

Кол-во уникальных email 6062
Кол-во уникальных user_id 86571

#### 9. Методом unique() определите, какие уникальные источники трафика есть в таблице. Результат выведите на экран.

In [59]:
logs['source'].unique()

array(['other', 'email', 'context', 'None', 'undef'], dtype=object)

In [61]:
hogwarts_points = pd.read_csv('data/hogwarts_points.csv')
hogwarts_points

  faculty_name      student_name  points
0   Гриффиндор      Гарри Поттер      15
1     Слизерин      Драко Малфой      28
2    Когтевран    Полумна Лавгуд      10
3          NaN         Рон Уизли       5
4    Пуффендуй    Седрик Диггори      17
5   Гриффиндор  Невилл Долгопупс      12

#### 10. Прежде чем заполнять пропуски, их нужно найти. Напечатайте на экране строки таблицы, у которых есть пропуски в столбце 'faculty_name'.

In [64]:
hogwarts_points[hogwarts_points['faculty_name'].isna()]

  faculty_name student_name  points
3          NaN    Рон Уизли       5

#### 11. Восстановите справедливость: верните Рону его факультет, заменив значение NaN на 'Гриффиндор' методом fillna().

In [65]:
hogwarts_points['faculty_name'] = hogwarts_points['faculty_name'].fillna(value='Гриффиндор')
hogwarts_points

  faculty_name      student_name  points
0   Гриффиндор      Гарри Поттер      15
1     Слизерин      Драко Малфой      28
2    Когтевран    Полумна Лавгуд      10
3   Гриффиндор         Рон Уизли       5
4    Пуффендуй    Седрик Диггори      17
5   Гриффиндор  Невилл Долгопупс      12

#### 12. Найдите суммарные баллы каждого из факультетов и сохраните результат в переменной faculty_points. Потом используя эту переменную найдите факультет-победитель и сохраните результат в переменной winner. В конце выведите значения обеих переменных на экран (уже в прекоде).

In [96]:
faculty_points = hogwarts_points.groupby('faculty_name')[['points']].sum()
faculty_points = faculty_points.sort_values(by='points', ascending=False).reset_index(drop=False)
winner = faculty_points.loc[0, 'faculty_name']

print('Победитель', winner)

Победитель Гриффиндор

#### 13. Возьмём источники трафика Яндекс.Маркета и рассчитаем конверсию.Найдите количество визитов из каждого источника трафика. Для этого сгруппируйте данные из столбца с идентификаторами пользователей по столбцу с источниками. Результат сохраните в переменной visits и выведите на экран.

In [97]:
logs.head()

      user_id   source       email  purchase
0  7141786820    other         NaN         0
1  5644686960    email  c129aa540a         0
2  1914055396  context         NaN         0
3  4099355752    other         NaN         0
4  6032477554  context         NaN         1

In [113]:
visits = logs.groupby('source')[['user_id']].count().reset_index(drop=False)
visits

    source  user_id
0     None     1674
1  context    52032
2    email    12279
3    other   133834
4    undef      181

#### 14. Посчитайте количество совершённых покупок для каждого источника трафика. Результат сохраните в переменной purchase и выведите на экран.

In [121]:
purchase = logs.groupby('source')[['purchase']].sum().reset_index(drop=False)
purchase

    source  purchase
0     None       108
1  context      3029
2    email       913
3    other      8041
4    undef        12

#### 15. Посчитайте конверсию по каждому источнику трафика, результат сохраните в переменной conversion и выведите на экран.

In [117]:
conversion = purchase['purchase'] / visits['user_id'] * 100
conversion

0    6.451613
1    5.821418
2    7.435459
3    6.008189
4    6.629834
dtype: float64

#### 15. В столбце email встречаются значения NaN — вместо электронных почт пользователей, не подписавшихся на рассылку магазина. Их электронный адрес вы вряд ли узнаете, и не сможете заполнить пропуски вручную. Да и самих NaN слишком много для ручной замены.Тем не менее избавиться от значений NaN можно, если заменить их единым значением. Например, пустой строкой. Так изучать таблицу будет проще: не нужно будет различать NaN и email-адрес.Замените пропуски пустыми строками, используя знакомый метод fillna(). После этого преобразования выведите на экран первые 5 строк датафрейма.

In [122]:
logs['email'] = logs['email'].fillna('')
logs.head()

      user_id   source       email  purchase
0  7141786820    other                     0
1  5644686960    email  c129aa540a         0
2  1914055396  context                     0
3  4099355752    other                     0
4  6032477554  context                     1

#### 16. Пропуски в столбце source записаны в строковом формате — 'None' вместо None. Выясните, случайно ли их возникновение: проверьте, имеет ли каждая строка с источником 'None' определённый email.Для этого примените к датафрейму logs два фильтра: Источник source равен 'None'; начение столбца email равно пустой строке ''.Выведите датафрейм с применёнными фильтрами.

In [124]:
logs[(logs['email'] == '') & (logs['source'] == 'None')]

Empty DataFrame
Columns: [user_id, source, email, purchase]
Index: []

Датафрейм пуст, значит пользователи оставляютсвой email в случае подписки на рассылку. Так, можно заменить все вхождения None в столбце source на email

In [125]:
logs['source'] = logs['source'].replace('None', 'email')
logs['source'].value_counts()

other      133834
context     52032
email       13953
undef         181
Name: source, dtype: int64

#### 17.Посчитайте количество визитов и покупок по источнику трафика ('source'). Вызовите метод agg.Сохраните результат в переменной logs_grouped и выведите на экран.

In [137]:
logs_grouped = logs.groupby('source').agg({
    'user_id' : 'count',
    'purchase' : 'sum'
})
logs_grouped

         user_id  purchase
source
context    52032      3029
email      13953      1021
other     133834      8041
undef        181        12

#### 18. Посчитайте конверсию визитов в покупки для каждого источника трафика (т. е. отношение столбца sum к count).Сохраните результат в новый столбец logs_grouped['conversion'] и выведите обновлённую таблицу на экран.

In [140]:
logs_grouped['conversion'] = logs_grouped['purchase'] / logs_grouped['user_id'] * 100
logs_grouped

         user_id  purchase  conversion
source
context    52032      3029    5.821418
email      13953      1021    7.317423
other     133834      8041    6.008189
undef        181        12    6.629834

#### 19.